Catalogs/Тренеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Тренеры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Туристы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Секции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаработнаяПлата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Тренеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ВернутьДР(ФИО)
	Возврат ФИО.ДатаРождения;
                    
КонецФункции        


Функция ВернутьПол(ФИО)
	Возврат ФИО.Пол;

КонецФункции

 Функция ВернутьСекцию(ФИО)
	Возврат ФИО.Секции;

КонецФункции

 Функция ВернутьВозраст(ФИО)
	Возврат ФИО.Возраст;

КонецФункции



&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	
	Объект.ДатаРождения = ВернутьДР(Объект.ФИО);
	Объект.Пол = ВернутьПол(Объект.ФИО);
	Объект.Секции = ВернутьСекцию(Объект.ФИО);   
	Объект.Возраст = ВернутьВозраст(Объект.ФИО);   
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Источник)
    Если Не ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
        ЭтотОбъект.Возраст = 0;
        Возврат;
    КонецЕсли;
    
    ТекущаяДата = ТекущаяДата();
    Возраст = ГОД(ТекущаяДата) - ГОД(Объект.ДатаРождения);
    
    Если (МЕСЯЦ(ТекущаяДата) < МЕСЯЦ(Объект.ДатаРождения)) Или 
       (МЕСЯЦ(ТекущаяДата) = МЕСЯЦ(Объект.ДатаРождения) И ДЕНЬ(ТекущаяДата) < ДЕНЬ(Объект.ДатаРождения)) Тогда
        Возраст = Возраст - 1;
    КонецЕсли;
    
    Объект.Возраст = Возраст;
КонецПроцедуры
